### Pandas-Dataframe
Pandas is a powerfull datamanipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structre : Series and Dataframe. 
A series is a one-dimentional array-like object...
Dataframe is two-dimentional, size-mutable and potentially heterogeneous tabular data structure with labeled axes(rows and columns)

In [4]:
import pandas as pd

In [8]:
# Series
import pandas as pd
data = [1, 2, 3, 4, 5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# Create a series from dictionary element
data={'a':1, 'b':2, 'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data=[12, 20, 30]
index=['a', 'b', 'c']
pd.Series(data,index=index)

a    12
b    20
c    30
dtype: int64

In [12]:
# Dataframe
# Create a Dataframe from a dictionary of list
data={
    'Name':['Yash','Ritam','Sayan'],
    'Age':[10,20,30],
    'Skill':['c','Python','java']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age   Skill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    java
<class 'pandas.core.frame.DataFrame'>

In [14]:
import numpy as np
np.array(df)

array([['Yash', 10, 'c'],
       ['Ritam', 20, 'Python'],
       ['Sayan', 30, 'java']], dtype=object)

In [15]:
# Create a dataframe from a list of Dictionaries
data=[
    {'Name':'Yash', 'Age':10, 'Slill':'c'},
    {'Name':'Ritam', 'Age':20, 'Slill':'Python'},
    {'Name':'Sayan', 'Age':30, 'Slill':'Java'}
]
df=pd.DataFrame(data)
print(df)

    Name  Age   Slill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    Java

In [ ]:
# for CSV files
df=pd.read_csv('name of dataframe')
df.head(5)
df.tail(5)

In [16]:
# Accessing data from dataframe
df

    Name  Age   Slill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    Java

In [17]:
df['Name']

0     Yash
1    Ritam
2    Sayan
Name: Name, dtype: object

In [20]:
# For row index
df.loc[0][0]

C:\Users\Yashraj2005\AppData\Local\Temp\ipykernel_25736\444829720.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Yash'

In [29]:
# for both row and clomn
df.iloc[0][0]

C:\Users\Yashraj2005\AppData\Local\Temp\ipykernel_25736\2995337146.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Yash'

In [35]:
# Accessing a specific element
df.at[0,'Name']

'Yash'

In [36]:
df

    Name  Age   Slill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    Java

In [38]:
# Accessing a specific element using iat
df.iat[2,2]

'Java'

In [39]:
# Data manipulation with Dataframe
df

    Name  Age   Slill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    Java

In [ ]:
# ADD a column
df['Salary']=[70,72,74]
df

    Name  Age   Slill  Salary
0   Yash   10       c      70
1  Ritam   20  Python      72
2  Sayan   30    Java      74

In [43]:
# Remove a column
'''
 hHere we have to add axis that by default checking the rows(axis=0)
 but here we have to check the column so covert the this axis into column(axis=1)
'''
df.drop('Salary', axis=1)

    Name  Age   Slill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    Java

In [45]:
df

    Name  Age   Slill  Salary
0   Yash   10       c      70
1  Ritam   20  Python      72
2  Sayan   30    Java      74

In [46]:
# Another problem is our column is not delete it is by default save
# For remove parmanantly column
df.drop('Salary', axis=1,inplace=True)

In [47]:
df

    Name  Age   Slill
0   Yash   10       c
1  Ritam   20  Python
2  Sayan   30    Java

In [48]:
# Add age to the column
df['Age']=df['Age']+1
df

    Name  Age   Slill
0   Yash   11       c
1  Ritam   21  Python
2  Sayan   31    Java

In [49]:
df.drop(0)

    Name  Age   Slill
1  Ritam   21  Python
2  Sayan   31    Java

In [50]:
df

    Name  Age   Slill
0   Yash   11       c
1  Ritam   21  Python
2  Sayan   31    Java

In [51]:
df.drop(0,inplace=True)

In [52]:
df

    Name  Age   Slill
1  Ritam   21  Python
2  Sayan   31    Java

In [ ]:
# Display the data types of each column
print("Data types: \n", df.dtypes)

# Describe the dataFrame
print("Statistical summary: \n", df.describe())

#Group by a column and perform an aggregation
groped=df.groupby('Catagory')['Value'].,mean()
print("Mean value by catagory:\n", groped)

# For statistical summary
df.describe()